Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pads_bank0.h
#define PADS_BANK0_GPIO24_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO24_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO24_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO24_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO25
#define PADS_BANK0_GPIO25_OFFSET _u(0x00000068)
#define PADS_BANK0_GPIO25_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO25_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO25_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO25_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO25_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO25_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO25_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO25_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO25_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO25_OD_MSB    _u(7)
#define PADS_BANK0_GPIO25_OD_LSB    _u(7)
#define PADS_BANK0_GPIO25_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_IE
// Description : Input enable
#define PADS_BANK0_GPIO25_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO25_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO25_IE_MSB    _u(6)
#define PADS_BANK0_GPIO25_IE_LSB    _u(6)
#define PADS_BANK0_GPIO25_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO25_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO25_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO25_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO25_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO25_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO25_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO25_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO25_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO25_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO25_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO25_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO25_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO25_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO25_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO25_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO25_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO25_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO25_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO25_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO25_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO25_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO25_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO25_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO25_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO25_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO25_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO25_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO25_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO25_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO25_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO26
#define PADS_BANK0_GPIO26_OFFSET _u(0x0000006c)
#define PADS_BANK0_GPIO26_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO26_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO26_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO26_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO26_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO26_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO26_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO26_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO26_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO26_OD_MSB    _u(7)
#define PADS_BANK0_GPIO26_OD_LSB    _u(7)
#define PADS_BANK0_GPIO26_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_IE
// Description : Input enable
#define PADS_BANK0_GPIO26_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO26_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO26_IE_MSB    _u(6)
#define PADS_BANK0_GPIO26_IE_LSB    _u(6)
#define PADS_BANK0_GPIO26_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO26_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO26_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO26_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO26_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO26_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO26_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO26_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO26_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO26_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO26_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO26_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO26_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO26_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO26_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO26_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO26_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO26_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO26_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO26_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO26_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO26_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO26_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO26_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO26_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO26_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO26_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO26_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO26_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO26_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO26_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO27
#define PADS_BANK0_GPIO27_OFFSET _u(0x00000070)
#define PADS_BANK0_GPIO27_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO27_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO27_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO27_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO27_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO27_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO27_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO27_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO27_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO27_OD_MSB    _u(7)
#define PADS_BANK0_GPIO27_OD_LSB    _u(7)
#define PADS_BANK0_GPIO27_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_IE
// Description : Input enable
#define PADS_BANK0_GPIO27_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO27_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO27_IE_MSB    _u(6)
#define PADS_BANK0_GPIO27_IE_LSB    _u(6)
#define PADS_BANK0_GPIO27_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO27_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO27_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO27_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO27_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO27_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO27_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO27_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO27_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO27_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO27_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO27_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO27_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO27_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO27_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO27_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO27_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO27_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO27_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO27_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO27_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO27_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO27_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO27_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO27_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO27_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO27_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO27_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO27_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO27_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO27_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO28
#define PADS_BANK0_GPIO28_OFFSET _u(0x00000074)
#define PADS_BANK0_GPIO28_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO28_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO28_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO28_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO28_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO28_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO28_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO28_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO28_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO28_OD_MSB    _u(7)
#define PADS_BANK0_GPIO28_OD_LSB    _u(7)
#define PADS_BANK0_GPIO28_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_IE
// Description : Input enable
#define PADS_BANK0_GPIO28_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO28_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO28_IE_MSB    _u(6)
#define PADS_BANK0_GPIO28_IE_LSB    _u(6)
#define PADS_BANK0_GPIO28_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO28_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO28_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO28_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO28_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO28_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO28_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO28_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO28_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO28_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO28_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO28_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO28_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO28_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO28_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO28_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO28_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO28_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO28_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO28_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO28_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO28_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO28_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO28_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO28_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO28_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO28_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO28_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO28_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO28_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO28_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO29
#define PADS_BANK0_GPIO29_OFFSET _u(0x00000078)
#define PADS_BANK0_GPIO29_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO29_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO29_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO29_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO29_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO29_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO29_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO29_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO29_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO29_OD_MSB    _u(7)
#define PADS_BANK0_GPIO29_OD_LSB    _u(7)
#define PADS_BANK0_GPIO29_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_IE
// Description : Input enable
#define PADS_BANK0_GPIO29_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO29_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO29_IE_MSB    _u(6)
#define PADS_BANK0_GPIO29_IE_LSB    _u(6)
#define PADS_BANK0_GPIO29_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO29_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO29_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO29_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO29_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO29_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO29_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO29_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO29_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO29_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO29_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO29_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO29_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO29_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO29_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO29_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO29_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO29_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO29_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO29_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO29_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO29_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO29_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO29_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO29_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO29_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO29_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO29_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO29_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO29_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO29_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO30
#define PADS_BANK0_GPIO30_OFFSET _u(0x0000007c)
#define PADS_BANK0_GPIO30_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO30_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO30_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO30_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO30_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO30_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO30_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO30_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO30_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO30_OD_MSB    _u(7)
#define PADS_BANK0_GPIO30_OD_LSB    _u(7)
#define PADS_BANK0_GPIO30_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_IE
// Description : Input enable
#define PADS_BANK0_GPIO30_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO30_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO30_IE_MSB    _u(6)
#define PADS_BANK0_GPIO30_IE_LSB    _u(6)
#define PADS_BANK0_GPIO30_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO30_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO30_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO30_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO30_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO30_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO30_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO30_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO30_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO30_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO30_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO30_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO30_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO30_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO30_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO30_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO30_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO30_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO30_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO30_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO30_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO30_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO30_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO30_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO30_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO30_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO30_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO30_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO30_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO30_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO30_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO31
#define PADS_BANK0_GPIO31_OFFSET _u(0x00000080)
#define PADS_BANK0_GPIO31_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO31_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO31_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO31_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO31_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO31_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO31_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_OD
