Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pads_bank0.h
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO31_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO31_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO31_OD_MSB    _u(7)
#define PADS_BANK0_GPIO31_OD_LSB    _u(7)
#define PADS_BANK0_GPIO31_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_IE
// Description : Input enable
#define PADS_BANK0_GPIO31_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO31_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO31_IE_MSB    _u(6)
#define PADS_BANK0_GPIO31_IE_LSB    _u(6)
#define PADS_BANK0_GPIO31_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO31_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO31_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO31_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO31_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO31_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO31_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO31_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO31_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO31_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO31_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO31_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO31_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO31_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO31_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO31_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO31_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO31_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO31_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO31_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO31_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO31_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO31_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO31_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO31_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO31_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO31_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO31_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO31_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO31_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO31_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO32
#define PADS_BANK0_GPIO32_OFFSET _u(0x00000084)
#define PADS_BANK0_GPIO32_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO32_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO32_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO32_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO32_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO32_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO32_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO32_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO32_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO32_OD_MSB    _u(7)
#define PADS_BANK0_GPIO32_OD_LSB    _u(7)
#define PADS_BANK0_GPIO32_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_IE
// Description : Input enable
#define PADS_BANK0_GPIO32_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO32_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO32_IE_MSB    _u(6)
#define PADS_BANK0_GPIO32_IE_LSB    _u(6)
#define PADS_BANK0_GPIO32_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO32_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO32_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO32_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO32_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO32_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO32_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO32_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO32_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO32_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO32_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO32_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO32_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO32_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO32_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO32_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO32_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO32_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO32_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO32_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO32_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO32_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO32_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO32_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO32_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO32_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO32_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO32_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO32_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO32_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO32_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO33
#define PADS_BANK0_GPIO33_OFFSET _u(0x00000088)
#define PADS_BANK0_GPIO33_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO33_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO33_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO33_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO33_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO33_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO33_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO33_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO33_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO33_OD_MSB    _u(7)
#define PADS_BANK0_GPIO33_OD_LSB    _u(7)
#define PADS_BANK0_GPIO33_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_IE
// Description : Input enable
#define PADS_BANK0_GPIO33_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO33_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO33_IE_MSB    _u(6)
#define PADS_BANK0_GPIO33_IE_LSB    _u(6)
#define PADS_BANK0_GPIO33_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO33_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO33_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO33_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO33_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO33_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO33_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO33_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO33_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO33_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO33_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO33_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO33_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO33_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO33_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO33_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO33_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO33_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO33_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO33_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO33_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO33_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO33_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO33_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO33_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO33_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO33_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO33_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO33_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO33_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO33_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO34
#define PADS_BANK0_GPIO34_OFFSET _u(0x0000008c)
#define PADS_BANK0_GPIO34_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO34_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO34_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO34_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO34_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO34_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO34_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO34_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO34_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO34_OD_MSB    _u(7)
#define PADS_BANK0_GPIO34_OD_LSB    _u(7)
#define PADS_BANK0_GPIO34_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_IE
// Description : Input enable
#define PADS_BANK0_GPIO34_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO34_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO34_IE_MSB    _u(6)
#define PADS_BANK0_GPIO34_IE_LSB    _u(6)
#define PADS_BANK0_GPIO34_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO34_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO34_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO34_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO34_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO34_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO34_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO34_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO34_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO34_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO34_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO34_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO34_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO34_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO34_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO34_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO34_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO34_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO34_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO34_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO34_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO34_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO34_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO34_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO34_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO34_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO34_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO34_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO34_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO34_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO34_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO35
#define PADS_BANK0_GPIO35_OFFSET _u(0x00000090)
#define PADS_BANK0_GPIO35_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO35_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO35_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO35_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO35_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO35_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO35_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO35_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO35_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO35_OD_MSB    _u(7)
#define PADS_BANK0_GPIO35_OD_LSB    _u(7)
#define PADS_BANK0_GPIO35_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_IE
// Description : Input enable
#define PADS_BANK0_GPIO35_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO35_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO35_IE_MSB    _u(6)
#define PADS_BANK0_GPIO35_IE_LSB    _u(6)
#define PADS_BANK0_GPIO35_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO35_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO35_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO35_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO35_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO35_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO35_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO35_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO35_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO35_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO35_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO35_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO35_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO35_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO35_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO35_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO35_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO35_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO35_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO35_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO35_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO35_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO35_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO35_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO35_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO35_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO35_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO35_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO35_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO35_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO35_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO36
#define PADS_BANK0_GPIO36_OFFSET _u(0x00000094)
#define PADS_BANK0_GPIO36_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO36_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO36_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO36_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO36_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO36_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO36_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO36_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO36_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO36_OD_MSB    _u(7)
#define PADS_BANK0_GPIO36_OD_LSB    _u(7)
#define PADS_BANK0_GPIO36_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_IE
// Description : Input enable
#define PADS_BANK0_GPIO36_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO36_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO36_IE_MSB    _u(6)
#define PADS_BANK0_GPIO36_IE_LSB    _u(6)
#define PADS_BANK0_GPIO36_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO36_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO36_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO36_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO36_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO36_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO36_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO36_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO36_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO36_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO36_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO36_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO36_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO36_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO36_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO36_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO36_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO36_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO36_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO36_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO36_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO36_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO36_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO36_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO36_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO36_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO36_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO36_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO36_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO36_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO36_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO37
#define PADS_BANK0_GPIO37_OFFSET _u(0x00000098)
#define PADS_BANK0_GPIO37_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO37_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO37_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO37_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO37_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO37_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO37_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO37_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO37_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO37_OD_MSB    _u(7)
#define PADS_BANK0_GPIO37_OD_LSB    _u(7)
#define PADS_BANK0_GPIO37_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_IE
// Description : Input enable
#define PADS_BANK0_GPIO37_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO37_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO37_IE_MSB    _u(6)
#define PADS_BANK0_GPIO37_IE_LSB    _u(6)
#define PADS_BANK0_GPIO37_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO37_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO37_DRIVE_BITS   _u(0x00000030)
