Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pads_bank0.h
#define PADS_BANK0_GPIO37_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO37_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO37_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO37_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO37_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO37_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO37_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO37_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO37_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO37_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO37_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO37_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO37_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO37_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO37_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO37_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO37_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO37_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO37_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO37_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO37_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO37_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO37_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO37_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO37_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO37_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO37_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO37_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO38
#define PADS_BANK0_GPIO38_OFFSET _u(0x0000009c)
#define PADS_BANK0_GPIO38_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO38_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO38_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO38_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO38_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO38_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO38_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO38_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO38_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO38_OD_MSB    _u(7)
#define PADS_BANK0_GPIO38_OD_LSB    _u(7)
#define PADS_BANK0_GPIO38_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_IE
// Description : Input enable
#define PADS_BANK0_GPIO38_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO38_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO38_IE_MSB    _u(6)
#define PADS_BANK0_GPIO38_IE_LSB    _u(6)
#define PADS_BANK0_GPIO38_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO38_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO38_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO38_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO38_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO38_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO38_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO38_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO38_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO38_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO38_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO38_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO38_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO38_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO38_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO38_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO38_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO38_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO38_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO38_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO38_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO38_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO38_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO38_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO38_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO38_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO38_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO38_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO38_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO38_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO38_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO39
#define PADS_BANK0_GPIO39_OFFSET _u(0x000000a0)
#define PADS_BANK0_GPIO39_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO39_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO39_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO39_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO39_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO39_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO39_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO39_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO39_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO39_OD_MSB    _u(7)
#define PADS_BANK0_GPIO39_OD_LSB    _u(7)
#define PADS_BANK0_GPIO39_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_IE
// Description : Input enable
#define PADS_BANK0_GPIO39_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO39_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO39_IE_MSB    _u(6)
#define PADS_BANK0_GPIO39_IE_LSB    _u(6)
#define PADS_BANK0_GPIO39_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO39_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO39_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO39_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO39_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO39_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO39_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO39_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO39_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO39_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO39_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO39_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO39_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO39_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO39_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO39_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO39_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO39_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO39_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO39_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO39_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO39_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO39_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO39_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO39_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO39_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO39_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO39_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO39_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO39_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO39_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO40
#define PADS_BANK0_GPIO40_OFFSET _u(0x000000a4)
#define PADS_BANK0_GPIO40_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO40_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO40_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO40_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO40_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO40_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO40_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO40_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO40_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO40_OD_MSB    _u(7)
#define PADS_BANK0_GPIO40_OD_LSB    _u(7)
#define PADS_BANK0_GPIO40_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_IE
// Description : Input enable
#define PADS_BANK0_GPIO40_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO40_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO40_IE_MSB    _u(6)
#define PADS_BANK0_GPIO40_IE_LSB    _u(6)
#define PADS_BANK0_GPIO40_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO40_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO40_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO40_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO40_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO40_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO40_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO40_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO40_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO40_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO40_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO40_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO40_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO40_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO40_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO40_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO40_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO40_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO40_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO40_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO40_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO40_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO40_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO40_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO40_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO40_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO40_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO40_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO40_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO40_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO40_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO41
#define PADS_BANK0_GPIO41_OFFSET _u(0x000000a8)
#define PADS_BANK0_GPIO41_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO41_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO41_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO41_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO41_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO41_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO41_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO41_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO41_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO41_OD_MSB    _u(7)
#define PADS_BANK0_GPIO41_OD_LSB    _u(7)
#define PADS_BANK0_GPIO41_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_IE
// Description : Input enable
#define PADS_BANK0_GPIO41_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO41_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO41_IE_MSB    _u(6)
#define PADS_BANK0_GPIO41_IE_LSB    _u(6)
#define PADS_BANK0_GPIO41_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO41_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO41_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO41_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO41_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO41_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO41_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO41_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO41_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO41_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO41_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO41_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO41_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO41_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO41_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO41_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO41_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO41_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO41_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO41_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO41_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO41_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO41_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO41_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO41_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO41_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO41_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO41_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO41_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO41_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO41_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO42
#define PADS_BANK0_GPIO42_OFFSET _u(0x000000ac)
#define PADS_BANK0_GPIO42_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO42_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO42_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO42_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO42_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO42_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO42_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO42_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO42_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO42_OD_MSB    _u(7)
#define PADS_BANK0_GPIO42_OD_LSB    _u(7)
#define PADS_BANK0_GPIO42_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_IE
// Description : Input enable
#define PADS_BANK0_GPIO42_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO42_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO42_IE_MSB    _u(6)
#define PADS_BANK0_GPIO42_IE_LSB    _u(6)
#define PADS_BANK0_GPIO42_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO42_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO42_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO42_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO42_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO42_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO42_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO42_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO42_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO42_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO42_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO42_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO42_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO42_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO42_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO42_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO42_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO42_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO42_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO42_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO42_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO42_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO42_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO42_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO42_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO42_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO42_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO42_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO42_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO42_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO42_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO43
#define PADS_BANK0_GPIO43_OFFSET _u(0x000000b0)
#define PADS_BANK0_GPIO43_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO43_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO43_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO43_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO43_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO43_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO43_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO43_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO43_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO43_OD_MSB    _u(7)
#define PADS_BANK0_GPIO43_OD_LSB    _u(7)
#define PADS_BANK0_GPIO43_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_IE
// Description : Input enable
#define PADS_BANK0_GPIO43_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO43_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO43_IE_MSB    _u(6)
#define PADS_BANK0_GPIO43_IE_LSB    _u(6)
#define PADS_BANK0_GPIO43_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO43_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO43_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO43_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO43_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO43_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO43_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO43_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO43_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO43_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO43_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO43_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO43_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO43_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO43_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO43_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO43_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO43_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO43_PDE_LSB    _u(2)
