Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pads_bank0.h
#define PADS_BANK0_GPIO43_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO43_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO43_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO43_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO43_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO43_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO43_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO43_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO43_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO43_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO43_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO43_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO44
#define PADS_BANK0_GPIO44_OFFSET _u(0x000000b4)
#define PADS_BANK0_GPIO44_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO44_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO44_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO44_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO44_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO44_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO44_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO44_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO44_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO44_OD_MSB    _u(7)
#define PADS_BANK0_GPIO44_OD_LSB    _u(7)
#define PADS_BANK0_GPIO44_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_IE
// Description : Input enable
#define PADS_BANK0_GPIO44_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO44_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO44_IE_MSB    _u(6)
#define PADS_BANK0_GPIO44_IE_LSB    _u(6)
#define PADS_BANK0_GPIO44_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO44_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO44_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO44_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO44_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO44_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO44_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO44_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO44_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO44_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO44_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO44_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO44_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO44_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO44_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO44_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO44_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO44_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO44_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO44_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO44_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO44_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO44_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO44_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO44_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO44_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO44_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO44_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO44_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO44_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO44_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO45
#define PADS_BANK0_GPIO45_OFFSET _u(0x000000b8)
#define PADS_BANK0_GPIO45_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO45_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO45_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO45_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO45_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO45_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO45_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO45_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO45_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO45_OD_MSB    _u(7)
#define PADS_BANK0_GPIO45_OD_LSB    _u(7)
#define PADS_BANK0_GPIO45_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_IE
// Description : Input enable
#define PADS_BANK0_GPIO45_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO45_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO45_IE_MSB    _u(6)
#define PADS_BANK0_GPIO45_IE_LSB    _u(6)
#define PADS_BANK0_GPIO45_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO45_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO45_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO45_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO45_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO45_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO45_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO45_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO45_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO45_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO45_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO45_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO45_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO45_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO45_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO45_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO45_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO45_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO45_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO45_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO45_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO45_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO45_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO45_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO45_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO45_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO45_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO45_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO45_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO45_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO45_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO46
#define PADS_BANK0_GPIO46_OFFSET _u(0x000000bc)
#define PADS_BANK0_GPIO46_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO46_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO46_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO46_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO46_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO46_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO46_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO46_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO46_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO46_OD_MSB    _u(7)
#define PADS_BANK0_GPIO46_OD_LSB    _u(7)
#define PADS_BANK0_GPIO46_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_IE
// Description : Input enable
#define PADS_BANK0_GPIO46_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO46_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO46_IE_MSB    _u(6)
#define PADS_BANK0_GPIO46_IE_LSB    _u(6)
#define PADS_BANK0_GPIO46_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO46_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO46_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO46_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO46_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO46_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO46_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO46_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO46_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO46_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO46_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO46_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO46_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO46_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO46_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO46_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO46_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO46_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO46_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO46_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO46_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO46_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO46_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO46_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO46_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO46_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO46_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO46_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO46_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO46_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO46_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_GPIO47
#define PADS_BANK0_GPIO47_OFFSET _u(0x000000c0)
#define PADS_BANK0_GPIO47_BITS   _u(0x000001ff)
#define PADS_BANK0_GPIO47_RESET  _u(0x00000116)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_GPIO47_ISO_RESET  _u(0x1)
#define PADS_BANK0_GPIO47_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_GPIO47_ISO_MSB    _u(8)
#define PADS_BANK0_GPIO47_ISO_LSB    _u(8)
#define PADS_BANK0_GPIO47_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_GPIO47_OD_RESET  _u(0x0)
#define PADS_BANK0_GPIO47_OD_BITS   _u(0x00000080)
#define PADS_BANK0_GPIO47_OD_MSB    _u(7)
#define PADS_BANK0_GPIO47_OD_LSB    _u(7)
#define PADS_BANK0_GPIO47_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_IE
// Description : Input enable
#define PADS_BANK0_GPIO47_IE_RESET  _u(0x0)
#define PADS_BANK0_GPIO47_IE_BITS   _u(0x00000040)
#define PADS_BANK0_GPIO47_IE_MSB    _u(6)
#define PADS_BANK0_GPIO47_IE_LSB    _u(6)
#define PADS_BANK0_GPIO47_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_GPIO47_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_GPIO47_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_GPIO47_DRIVE_MSB    _u(5)
#define PADS_BANK0_GPIO47_DRIVE_LSB    _u(4)
#define PADS_BANK0_GPIO47_DRIVE_ACCESS "RW"
#define PADS_BANK0_GPIO47_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_GPIO47_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_GPIO47_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_GPIO47_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_PUE
// Description : Pull up enable
#define PADS_BANK0_GPIO47_PUE_RESET  _u(0x0)
#define PADS_BANK0_GPIO47_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_GPIO47_PUE_MSB    _u(3)
#define PADS_BANK0_GPIO47_PUE_LSB    _u(3)
#define PADS_BANK0_GPIO47_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_PDE
// Description : Pull down enable
#define PADS_BANK0_GPIO47_PDE_RESET  _u(0x1)
#define PADS_BANK0_GPIO47_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_GPIO47_PDE_MSB    _u(2)
#define PADS_BANK0_GPIO47_PDE_LSB    _u(2)
#define PADS_BANK0_GPIO47_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_GPIO47_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_GPIO47_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_GPIO47_SCHMITT_MSB    _u(1)
#define PADS_BANK0_GPIO47_SCHMITT_LSB    _u(1)
#define PADS_BANK0_GPIO47_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_GPIO47_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_GPIO47_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_GPIO47_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_GPIO47_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_GPIO47_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_GPIO47_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_SWCLK
#define PADS_BANK0_SWCLK_OFFSET _u(0x000000c4)
#define PADS_BANK0_SWCLK_BITS   _u(0x000001ff)
#define PADS_BANK0_SWCLK_RESET  _u(0x0000005a)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_SWCLK_ISO_RESET  _u(0x0)
#define PADS_BANK0_SWCLK_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_SWCLK_ISO_MSB    _u(8)
#define PADS_BANK0_SWCLK_ISO_LSB    _u(8)
#define PADS_BANK0_SWCLK_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_SWCLK_OD_RESET  _u(0x0)
#define PADS_BANK0_SWCLK_OD_BITS   _u(0x00000080)
#define PADS_BANK0_SWCLK_OD_MSB    _u(7)
#define PADS_BANK0_SWCLK_OD_LSB    _u(7)
#define PADS_BANK0_SWCLK_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_IE
// Description : Input enable
#define PADS_BANK0_SWCLK_IE_RESET  _u(0x1)
#define PADS_BANK0_SWCLK_IE_BITS   _u(0x00000040)
#define PADS_BANK0_SWCLK_IE_MSB    _u(6)
#define PADS_BANK0_SWCLK_IE_LSB    _u(6)
#define PADS_BANK0_SWCLK_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_SWCLK_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_SWCLK_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_SWCLK_DRIVE_MSB    _u(5)
#define PADS_BANK0_SWCLK_DRIVE_LSB    _u(4)
#define PADS_BANK0_SWCLK_DRIVE_ACCESS "RW"
#define PADS_BANK0_SWCLK_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_SWCLK_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_SWCLK_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_SWCLK_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_PUE
// Description : Pull up enable
#define PADS_BANK0_SWCLK_PUE_RESET  _u(0x1)
#define PADS_BANK0_SWCLK_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_SWCLK_PUE_MSB    _u(3)
#define PADS_BANK0_SWCLK_PUE_LSB    _u(3)
#define PADS_BANK0_SWCLK_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_PDE
// Description : Pull down enable
#define PADS_BANK0_SWCLK_PDE_RESET  _u(0x0)
#define PADS_BANK0_SWCLK_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_SWCLK_PDE_MSB    _u(2)
#define PADS_BANK0_SWCLK_PDE_LSB    _u(2)
#define PADS_BANK0_SWCLK_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_SWCLK_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_SWCLK_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_SWCLK_SCHMITT_MSB    _u(1)
#define PADS_BANK0_SWCLK_SCHMITT_LSB    _u(1)
#define PADS_BANK0_SWCLK_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWCLK_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_SWCLK_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_SWCLK_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_SWCLK_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_SWCLK_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_SWCLK_SLEWFAST_ACCESS "RW"
// =============================================================================
// Register    : PADS_BANK0_SWD
#define PADS_BANK0_SWD_OFFSET _u(0x000000c8)
#define PADS_BANK0_SWD_BITS   _u(0x000001ff)
#define PADS_BANK0_SWD_RESET  _u(0x0000005a)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_ISO
// Description : Pad isolation control. Remove this once the pad is configured
//               by software.
#define PADS_BANK0_SWD_ISO_RESET  _u(0x0)
#define PADS_BANK0_SWD_ISO_BITS   _u(0x00000100)
#define PADS_BANK0_SWD_ISO_MSB    _u(8)
#define PADS_BANK0_SWD_ISO_LSB    _u(8)
#define PADS_BANK0_SWD_ISO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_OD
// Description : Output disable. Has priority over output enable from
//               peripherals
#define PADS_BANK0_SWD_OD_RESET  _u(0x0)
#define PADS_BANK0_SWD_OD_BITS   _u(0x00000080)
#define PADS_BANK0_SWD_OD_MSB    _u(7)
#define PADS_BANK0_SWD_OD_LSB    _u(7)
#define PADS_BANK0_SWD_OD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_IE
// Description : Input enable
#define PADS_BANK0_SWD_IE_RESET  _u(0x1)
#define PADS_BANK0_SWD_IE_BITS   _u(0x00000040)
#define PADS_BANK0_SWD_IE_MSB    _u(6)
#define PADS_BANK0_SWD_IE_LSB    _u(6)
#define PADS_BANK0_SWD_IE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_DRIVE
// Description : Drive strength.
//               0x0 -> 2mA
//               0x1 -> 4mA
//               0x2 -> 8mA
//               0x3 -> 12mA
#define PADS_BANK0_SWD_DRIVE_RESET  _u(0x1)
#define PADS_BANK0_SWD_DRIVE_BITS   _u(0x00000030)
#define PADS_BANK0_SWD_DRIVE_MSB    _u(5)
#define PADS_BANK0_SWD_DRIVE_LSB    _u(4)
#define PADS_BANK0_SWD_DRIVE_ACCESS "RW"
#define PADS_BANK0_SWD_DRIVE_VALUE_2MA _u(0x0)
#define PADS_BANK0_SWD_DRIVE_VALUE_4MA _u(0x1)
#define PADS_BANK0_SWD_DRIVE_VALUE_8MA _u(0x2)
#define PADS_BANK0_SWD_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_PUE
// Description : Pull up enable
#define PADS_BANK0_SWD_PUE_RESET  _u(0x1)
#define PADS_BANK0_SWD_PUE_BITS   _u(0x00000008)
#define PADS_BANK0_SWD_PUE_MSB    _u(3)
#define PADS_BANK0_SWD_PUE_LSB    _u(3)
#define PADS_BANK0_SWD_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_PDE
// Description : Pull down enable
#define PADS_BANK0_SWD_PDE_RESET  _u(0x0)
#define PADS_BANK0_SWD_PDE_BITS   _u(0x00000004)
#define PADS_BANK0_SWD_PDE_MSB    _u(2)
#define PADS_BANK0_SWD_PDE_LSB    _u(2)
#define PADS_BANK0_SWD_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_SCHMITT
// Description : Enable schmitt trigger
#define PADS_BANK0_SWD_SCHMITT_RESET  _u(0x1)
#define PADS_BANK0_SWD_SCHMITT_BITS   _u(0x00000002)
#define PADS_BANK0_SWD_SCHMITT_MSB    _u(1)
#define PADS_BANK0_SWD_SCHMITT_LSB    _u(1)
#define PADS_BANK0_SWD_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_BANK0_SWD_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_BANK0_SWD_SLEWFAST_RESET  _u(0x0)
#define PADS_BANK0_SWD_SLEWFAST_BITS   _u(0x00000001)
#define PADS_BANK0_SWD_SLEWFAST_MSB    _u(0)
#define PADS_BANK0_SWD_SLEWFAST_LSB    _u(0)
#define PADS_BANK0_SWD_SLEWFAST_ACCESS "RW"
// =============================================================================
#endif // _HARDWARE_REGS_PADS_BANK0_H

